<?xml version="1.0" ?>
<net name="segment_person_160x256_v2" version="10">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,160,256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="model/conv1/Conv2D/Transpose7814_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="20,3,3,3" size="1080"/>
			<output>
				<port id="1" precision="FP16">
					<dim>20</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="model/conv1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="4,4"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>20</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model/conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data_mul_57676037/EltwiseUnsqueeze6150_const" type="Const" version="opset1">
			<data element_type="f16" offset="1080" shape="1,20,1,1" size="40"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="model/conv1_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="data_add_57696038/EltwiseUnsqueeze6154_const" type="Const" version="opset1">
			<data element_type="f16" offset="1120" shape="1,20,1,1" size="40"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model/conv1_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="1099610999_const" type="Const" version="opset1">
			<data element_type="f16" offset="1160" shape="20,1,1,3,3" size="360"/>
			<output>
				<port id="1" precision="FP16">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model/conv_dw_1/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model/conv_dw_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="data_mul_577157756039/EltwiseUnsqueeze6158_const" type="Const" version="opset1">
			<data element_type="f16" offset="1520" shape="1,20,1,1" size="40"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model/conv_dw_1_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_577257776040/EltwiseUnsqueeze6162_const" type="Const" version="opset1">
			<data element_type="f16" offset="1560" shape="1,20,1,1" size="40"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model/conv_dw_1_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model/conv_pw_1/Conv2D/Transpose7822_const" type="Const" version="opset1">
			<data element_type="f16" offset="1600" shape="40,20,1,1" size="1600"/>
			<output>
				<port id="1" precision="FP16">
					<dim>40</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="model/conv_pw_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="model/conv_pw_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_mul_577957836041/EltwiseUnsqueeze6166_const" type="Const" version="opset1">
			<data element_type="f16" offset="3200" shape="1,40,1,1" size="80"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model/conv_pw_1_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="data_add_578057856042/EltwiseUnsqueeze6170_const" type="Const" version="opset1">
			<data element_type="f16" offset="3280" shape="1,40,1,1" size="80"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model/conv_pw_1_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="1103211035_const" type="Const" version="opset1">
			<data element_type="f16" offset="3360" shape="40,1,1,3,3" size="720"/>
			<output>
				<port id="1" precision="FP16">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model/conv_dw_2/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model/conv_dw_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="data_mul_578757916043/EltwiseUnsqueeze6174_const" type="Const" version="opset1">
			<data element_type="f16" offset="4080" shape="1,40,1,1" size="80"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model/conv_dw_2_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_add_578857936044/EltwiseUnsqueeze6178_const" type="Const" version="opset1">
			<data element_type="f16" offset="4160" shape="1,40,1,1" size="80"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model/conv_dw_2_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model/conv_pw_2/Conv2D/Transpose7834_const" type="Const" version="opset1">
			<data element_type="f16" offset="4240" shape="80,40,1,1" size="6400"/>
			<output>
				<port id="1" precision="FP16">
					<dim>80</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="model/conv_pw_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="model/conv_pw_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="data_mul_579557996045/EltwiseUnsqueeze6182_const" type="Const" version="opset1">
			<data element_type="f16" offset="10640" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model/conv_pw_2_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="data_add_579658016046/EltwiseUnsqueeze6186_const" type="Const" version="opset1">
			<data element_type="f16" offset="10800" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="model/conv_pw_2_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="1101211015_const" type="Const" version="opset1">
			<data element_type="f16" offset="10960" shape="80,1,1,3,3" size="1440"/>
			<output>
				<port id="1" precision="FP16">
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model/conv_dw_3/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model/conv_dw_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="data_mul_580358076047/EltwiseUnsqueeze6190_const" type="Const" version="opset1">
			<data element_type="f16" offset="12400" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="model/conv_dw_3_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="data_add_580458096048/EltwiseUnsqueeze6194_const" type="Const" version="opset1">
			<data element_type="f16" offset="12560" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model/conv_dw_3_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model/conv_pw_3/Conv2D/Transpose7842_const" type="Const" version="opset1">
			<data element_type="f16" offset="12720" shape="80,80,1,1" size="12800"/>
			<output>
				<port id="1" precision="FP16">
					<dim>80</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="model/conv_pw_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="model/conv_pw_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="data_mul_581158156049/EltwiseUnsqueeze6198_const" type="Const" version="opset1">
			<data element_type="f16" offset="25520" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model/conv_pw_3_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="data_add_581258176050/EltwiseUnsqueeze6202_const" type="Const" version="opset1">
			<data element_type="f16" offset="25680" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="model/conv_pw_3_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="1098810991_const" type="Const" version="opset1">
			<data element_type="f16" offset="25840" shape="80,1,1,3,3" size="1440"/>
			<output>
				<port id="1" precision="FP16">
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="model/conv_dw_4/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>20</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="model/conv_dw_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_mul_581958236051/EltwiseUnsqueeze6206_const" type="Const" version="opset1">
			<data element_type="f16" offset="27280" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="model/conv_dw_4_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="data_add_582058256052/EltwiseUnsqueeze6210_const" type="Const" version="opset1">
			<data element_type="f16" offset="27440" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="model/conv_dw_4_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model/conv_pw_4/Conv2D/Transpose7854_const" type="Const" version="opset1">
			<data element_type="f16" offset="27600" shape="160,80,1,1" size="25600"/>
			<output>
				<port id="1" precision="FP16">
					<dim>160</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="model/conv_pw_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>160</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model/conv_pw_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="data_mul_582758316053/EltwiseUnsqueeze6214_const" type="Const" version="opset1">
			<data element_type="f16" offset="53200" shape="1,160,1,1" size="320"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model/conv_pw_4_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="data_add_582858336054/EltwiseUnsqueeze6218_const" type="Const" version="opset1">
			<data element_type="f16" offset="53520" shape="1,160,1,1" size="320"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="model/conv_pw_4_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="1102011023_const" type="Const" version="opset1">
			<data element_type="f16" offset="53840" shape="160,1,1,3,3" size="2880"/>
			<output>
				<port id="1" precision="FP16">
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="model/conv_dw_5/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model/conv_dw_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_mul_583558396055/EltwiseUnsqueeze6222_const" type="Const" version="opset1">
			<data element_type="f16" offset="56720" shape="1,160,1,1" size="320"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="model/conv_dw_5_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="data_add_583658416056/EltwiseUnsqueeze6226_const" type="Const" version="opset1">
			<data element_type="f16" offset="57040" shape="1,160,1,1" size="320"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="model/conv_dw_5_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model/conv_pw_5/Conv2D/Transpose7862_const" type="Const" version="opset1">
			<data element_type="f16" offset="57360" shape="160,160,1,1" size="51200"/>
			<output>
				<port id="1" precision="FP16">
					<dim>160</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="model/conv_pw_5/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>160</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model/conv_pw_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="data_mul_584358476057/EltwiseUnsqueeze6230_const" type="Const" version="opset1">
			<data element_type="f16" offset="108560" shape="1,160,1,1" size="320"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="model/conv_pw_5_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="data_add_584458496058/EltwiseUnsqueeze6234_const" type="Const" version="opset1">
			<data element_type="f16" offset="108880" shape="1,160,1,1" size="320"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="model/conv_pw_5_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="1103611039_const" type="Const" version="opset1">
			<data element_type="f16" offset="109200" shape="160,1,1,3,3" size="2880"/>
			<output>
				<port id="1" precision="FP16">
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="model/conv_dw_6/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model/conv_dw_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_mul_585158556059/EltwiseUnsqueeze6238_const" type="Const" version="opset1">
			<data element_type="f16" offset="112080" shape="1,160,1,1" size="320"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="model/conv_dw_6_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="data_add_585258576060/EltwiseUnsqueeze6242_const" type="Const" version="opset1">
			<data element_type="f16" offset="112400" shape="1,160,1,1" size="320"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model/conv_dw_6_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="model/conv_pw_6/Conv2D/Transpose7874_const" type="Const" version="opset1">
			<data element_type="f16" offset="112720" shape="320,160,1,1" size="102400"/>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="model/conv_pw_6/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>320</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="model/conv_pw_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="data_mul_585958636061/EltwiseUnsqueeze6246_const" type="Const" version="opset1">
			<data element_type="f16" offset="215120" shape="1,320,1,1" size="640"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="model/conv_pw_6_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="data_add_586058656062/EltwiseUnsqueeze6250_const" type="Const" version="opset1">
			<data element_type="f16" offset="215760" shape="1,320,1,1" size="640"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model/conv_pw_6_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="1100411007_const" type="Const" version="opset1">
			<data element_type="f16" offset="216400" shape="320,1,1,3,3" size="5760"/>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="model/conv_dw_7/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="model/conv_dw_7/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="data_mul_586758716063/EltwiseUnsqueeze6254_const" type="Const" version="opset1">
			<data element_type="f16" offset="222160" shape="1,320,1,1" size="640"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="model/conv_dw_7_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="data_add_586858736064/EltwiseUnsqueeze6258_const" type="Const" version="opset1">
			<data element_type="f16" offset="222800" shape="1,320,1,1" size="640"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="model/conv_dw_7_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="model/conv_pw_7/Conv2D/Transpose7882_const" type="Const" version="opset1">
			<data element_type="f16" offset="223440" shape="320,320,1,1" size="204800"/>
			<output>
				<port id="1" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="model/conv_pw_7/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="model/conv_pw_7/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="data_mul_587558796065/EltwiseUnsqueeze6262_const" type="Const" version="opset1">
			<data element_type="f16" offset="428240" shape="1,320,1,1" size="640"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="model/conv_pw_7_bn/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="data_add_587658816066/EltwiseUnsqueeze6266_const" type="Const" version="opset1">
			<data element_type="f16" offset="428880" shape="1,320,1,1" size="640"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="model/conv_pw_7_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="model/subpixel_5/DepthToSpace" type="DepthToSpace" version="opset1">
			<data block_size="2" mode="blocks_first"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>5</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="model/conv2d/Conv2D/Transpose7866_const" type="Const" version="opset1">
			<data element_type="f16" offset="429520" shape="80,160,1,1" size="25600"/>
			<output>
				<port id="1" precision="FP16">
					<dim>80</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="model/conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="model/conv2d/BiasAdd/ReadVariableOp/EltwiseUnsqueeze6130_const" type="Const" version="opset1">
			<data element_type="f16" offset="455120" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="model/conv2d/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="model/conv2d_1/Conv2D/Transpose7886_const" type="Const" version="opset1">
			<data element_type="f16" offset="455280" shape="80,80,1,1" size="12800"/>
			<output>
				<port id="1" precision="FP16">
					<dim>80</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="model/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="model/conv2d_1/BiasAdd/ReadVariableOp/EltwiseUnsqueeze6110_const" type="Const" version="opset1">
			<data element_type="f16" offset="468080" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="model/conv2d_1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="model/add/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="model/activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="model/conv2d_2/Conv2D/Transpose7890_const" type="Const" version="opset1">
			<data element_type="f16" offset="468240" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="model/conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>10</dim>
